{
  "menu": {
    "starters": [
      {
        "id": 1,
        "name": "Bruschetta",
        "description": "Toasted bread with fresh tomatoes, basil, and olive oil.",
        "price": 6.99,
        "image": "img/food/bruschetta.jpg"
      },
      {
        "id": 2,
        "name": "Caesar Salad",
        "description": "Crisp romaine lettuce with Caesar dressing and croutons.",
        "price": 7.99,
        "image": "img/food/caesar-salad.jpg"
      }
    ],
    "main-courses": [
      {
        "id": 3,
        "name": "Grilled Salmon",
        "description": "Fresh salmon fillet with lemon butter sauce.",
        "price": 18.99,
        "image": "img/food/grilled-salmon.jpg"
      },
      {
        "id": 4,
        "name": "Spaghetti Carbonara",
        "description": "Classic Italian pasta with creamy egg-based sauce and pancetta.",
        "price": 14.99,
        "image": "img/food/spagetti-carbonara.jpg"
      }
    ],
    "desserts": [
      {
        "id": 5,
        "name": "Tiramisu",
        "description": "Traditional Italian coffee-flavored dessert.",
        "price": 8.99,
        "image": "img/food/tiramisu.jpg"
      },
      {
        "id": 6,
        "name": "Chocolate Lava Cake",
        "description": "Warm chocolate cake with a gooey center.",
        "price": 9.99,
        "image": "img/food/lava-cake.jpg"
      }
    ]
  },
  "lunchBuffet": {
    "description": "Our lunch buffet offers a wide variety of dishes, including hot and cold options, fresh salads, and delicious desserts. Served Monday to Friday with a changing selection every day.",
    "servingTimes": {
      "monday_to_friday": {
        "lunchStart": "11:30 AM",
        "lunchEnd": "02:00 PM"
      }
    },
    "specialOffers": {
      "today": {
        "offer": "Meatballs with mashed potatoes and lingonberry jam",
        "price": "$15.00"
      }
    },
    "priceList": {
      "adult": {
        "standard": "$17.50",
        "child": "$9.50",
        "drinkIncluded": "$19.00"
      },
      "extras": {
        "extraBread": "$1.00",
        "extraDessert": "$1.50",
        "coffee": "$2.00",
        "softDrink": "$2.50"
      }
    },
    "beverages": {
      "included": ["water", "coffee", "tea"],
      "optional": ["soda", "juice", "beer", "wine"]
    }
  },
  "about": {
    "welcome": "Welcome to Restaurant Larsson",
    "text": "Where Tradition Meets Innovation\n\nSince opening our doors in 2025, Restaurant Larsson has been committed to providing an unforgettable dining experience that celebrates both the rich culinary heritage and innovative spirit of Strängnäs. Born out of a passion for authentic flavors and a dedication to quality, we’ve become a beloved destination for food lovers seeking both tradition and creativity in every bite.\n\nOur concept revolves around the idea that food should be both an art and a story. We take pride in honoring the time-honored techniques passed down through generations while embracing modern culinary trends. Each dish we serve is a fusion of classic recipes and contemporary twists, designed to delight the senses and spark new experiences.\n\nAt Restaurant Larsson, we are deeply committed to sustainability and supporting local farmers and artisans. Our philosophy is simple: use the finest seasonal ingredients to create dishes that are fresh, flavorful, and full of integrity. We believe in respecting the natural flavors of our ingredients, enhancing them with delicate techniques that bring out their best.\n\nFrom our handmade pastas and tender meats to our vibrant plant-based options, every meal we serve is a celebration of what the earth offers. Pair your meal with one of our carefully curated wines or innovative cocktails, and allow us to guide you on a culinary journey that honors both the past and the future.\n\nWhether you’re a long-time friend or a first-time guest, we invite you to experience the heart and soul of Restaurant Larsson, every dish tells a story, and every meal is a celebration of life’s simple pleasures."
  }
}
